The following is an example of using list to replace set to solve the problem, I am not sure if it will help you.

```
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

locals  {
  rules = [
    {
      name = "c1"
      subnet = "10.1.0.0 255.255.255.0"
      type = "ipmask"
    },
    {
      name = "c3"
      subnet = "10.3.0.0 255.255.255.0"
      type = "ipmask"
    },
  ]
}

resource "fortios_firewall_address" "trname1" {
  count = length(local.rules)
  name          = local.rules[count.index].name
  subnet        = local.rules[count.index].subnet
  type          = local.rules[count.index].type

  lifecycle {
    create_before_destroy = true
  }
}

resource "fortios_firewall_addrgrp" "trname" {
  name          = "testgrp"

  dynamic "member" {
    for_each = local.rules

    content {
      name = member.value.name
    }
  }

  depends_on = [fortios_firewall_address.trname1]
}

# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_firewall_address.trname1[0] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c1"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "10.1.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.trname1[1] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c3"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "10.3.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_addrgrp.trname will be created
  + resource "fortios_firewall_addrgrp" "trname" {
      + allow_routing = (known after apply)
      + color         = (known after apply)
      + exclude       = (known after apply)
      + id            = (known after apply)
      + name          = "testgrp"
      + uuid          = (known after apply)
      + visibility    = (known after apply)

      + member {
          + name = "c1"
        }
      + member {
          + name = "c3"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_address.trname1[1]: Creating...
fortios_firewall_address.trname1[0]: Creating...
fortios_firewall_address.trname1[0]: Creation complete after 0s [id=c1]
fortios_firewall_address.trname1[1]: Creation complete after 1s [id=c3]
fortios_firewall_addrgrp.trname: Creating...
fortios_firewall_addrgrp.trname: Creation complete after 0s [id=testgrp]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

```
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

locals  {
  rules = [
    {
      name = "c1"
      subnet = "10.1.0.0 255.255.255.0"
      type = "ipmask"
    },
    {
      name = "c3"
      subnet = "10.3.0.0 255.255.255.0"
      type = "ipmask"
    },
    {
      name = "c4"
      subnet = "10.4.0.0 255.255.255.0"
      type = "ipmask"
    },
    {
      name = "c2"
      subnet = "10.5.0.0 255.255.255.0"
      type = "ipmask"
    },
    {
      name = "c0"
      subnet = "20.5.0.0 255.255.255.0"
      type = "ipmask"
    }
  ]
}

resource "fortios_firewall_address" "trname1" {
  count = length(local.rules)
  name          = local.rules[count.index].name
  subnet        = local.rules[count.index].subnet
  type          = local.rules[count.index].type

  lifecycle {
    create_before_destroy = true
  }
}

resource "fortios_firewall_addrgrp" "trname" {
  name          = "testgrp"

  dynamic "member" {
    for_each = local.rules

    content {
      name = member.value.name
    }
  }

  depends_on = [fortios_firewall_address.trname1]
}

# terraform plan
  ----
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_address.trname1[0]: Refreshing state... [id=c1]
fortios_firewall_address.trname1[1]: Refreshing state... [id=c3]
fortios_firewall_addrgrp.trname: Refreshing state... [id=testgrp]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # fortios_firewall_address.trname1[2] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c4"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "10.4.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.trname1[3] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c2"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "10.5.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.trname1[4] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c0"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "20.5.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_addrgrp.trname will be updated in-place
  ~ resource "fortios_firewall_addrgrp" "trname" {
        allow_routing = "disable"
        color         = 0
        exclude       = "disable"
        id            = "testgrp"
        name          = "testgrp"
        uuid          = "3f5afda6-55ed-51eb-e934-034458f49cbf"

        member {
            name = "c1"
        }
        member {
            name = "c3"
        }
      + member {
          + name = "c4"
        }
      + member {
          + name = "c2"
        }
      + member {
          + name = "c0"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

# terraform apply
  ----
fortios_firewall_address.trname1[0]: Refreshing state... [id=c1]
fortios_firewall_address.trname1[1]: Refreshing state... [id=c3]
fortios_firewall_addrgrp.trname: Refreshing state... [id=testgrp]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # fortios_firewall_address.trname1[2] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c4"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "10.4.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.trname1[3] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c2"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "10.5.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_address.trname1[4] will be created
  + resource "fortios_firewall_address" "trname1" {
      + allow_routing        = (known after apply)
      + associated_interface = (known after apply)
      + cache_ttl            = (known after apply)
      + color                = (known after apply)
      + country              = (known after apply)
      + end_ip               = (known after apply)
      + epg_name             = (known after apply)
      + fqdn                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "c0"
      + organization         = (known after apply)
      + policy_group         = (known after apply)
      + sdn                  = (known after apply)
      + sdn_tag              = (known after apply)
      + start_ip             = (known after apply)
      + subnet               = "20.5.0.0 255.255.255.0"
      + subnet_name          = (known after apply)
      + tenant               = (known after apply)
      + type                 = "ipmask"
      + uuid                 = (known after apply)
      + visibility           = (known after apply)
      + wildcard             = (known after apply)
      + wildcard_fqdn        = (known after apply)
    }

  # fortios_firewall_addrgrp.trname will be updated in-place
  ~ resource "fortios_firewall_addrgrp" "trname" {
        allow_routing = "disable"
        color         = 0
        exclude       = "disable"
        id            = "testgrp"
        name          = "testgrp"
        uuid          = "3f5afda6-55ed-51eb-e934-034458f49cbf"

        member {
            name = "c1"
        }
        member {
            name = "c3"
        }
      + member {
          + name = "c4"
        }
      + member {
          + name = "c2"
        }
      + member {
          + name = "c0"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_firewall_address.trname1[3]: Creating...
fortios_firewall_address.trname1[2]: Creating...
fortios_firewall_address.trname1[4]: Creating...
fortios_firewall_address.trname1[4]: Creation complete after 0s [id=c0]
fortios_firewall_address.trname1[3]: Creation complete after 0s [id=c2]
fortios_firewall_address.trname1[2]: Creation complete after 0s [id=c4]
fortios_firewall_addrgrp.trname: Modifying... [id=testgrp]
fortios_firewall_addrgrp.trname: Modifications complete after 0s [id=testgrp]

Apply complete! Resources: 3 added, 1 changed, 0 destroyed.

```

```
# terraform plan
  ----
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_firewall_address.trname1[2]: Refreshing state... [id=c4]
fortios_firewall_address.trname1[3]: Refreshing state... [id=c2]
fortios_firewall_address.trname1[4]: Refreshing state... [id=c0]
fortios_firewall_address.trname1[0]: Refreshing state... [id=c1]
fortios_firewall_address.trname1[1]: Refreshing state... [id=c3]
fortios_firewall_addrgrp.trname: Refreshing state... [id=testgrp]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

```

Thanks!
